#include <puppybot.h>

/*ตัวอย่างคำสั่งสำหรับการใช้งานมอเตอร์
ao();  	      //หยุดมอเตอร์แบบ เบรคทั้ง 4 ตัว
fd(50);       //เดินหน้า   ด้วยความเร็ว  50 %
bk(30);       //ถอยหลัง   ด้วยความเร็ว  30 %
tl(45);       //เลี้ยวซ้าย   ด้วยความเร็ว  45 %
tr(60);       //เลี้ยวขวา   ด้วยความเร็ว  60 %
sl(28);       //หมุนซ้าย   ด้วยความเร็ว  28 %
sr(40);       //หมุนขวา   ด้วยความเร็ว  40 %

motorStop(0);     //มอเตอร์หยุดจ่ายไฟ    ทั้ง 2 มอเตอร์
motorBreak(0);    //มอเตอร์เบรค         ทั้ง 2 มอเตอร์ 
                  เลข 0 คือ หยุดทั้ง 2 ล้อ
                  เลข 1 คือ มอเตอร์ ตัวที่ 1
                  เลข 2 คือ มอเตอร์ ตัวที่ 2

*/
void setup() {
 puppybot_setup();
 wait_SW1();
 motor(1,50);
 motor(2,50);
 delay(1000);
 bk(30);
 delay(1000);
 motorBreak(0);
wait_SW1();
}

void loop() {
  motor(1,50);
 motor(2,50);
 motor(3,50);
 motor(4,50);
 delay(1000);

 motor(1,100);
 motor(2,100);
 motor(3,100);
 motor(4,100);
 delay(1000);
 
 motor(1,0);
 motor(2,0);
 motor(3,0);
 motor(4,0);
 delay(1000);

  motor(1,-50);
 motor(2,-50);
 motor(3,-50);
 motor(4,-50);
 delay(1000);
 
 motor(1,-100);
 motor(2,-100);
 motor(3,-100);
 motor(4,-100);
 delay(1000);
 
 motor(1,0);
 motor(2,0);
 motor(3,0);
 motor(4,0);
 delay(1000);
  
}
